Masmiseim36/nxpSDK/boards/hvpkv46f150m/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKV46F256xxx16
package_id: MKV46F256VLL16
mcu_data: ksdk2_0
processor_version: 4.0.0
board: HVP-KV46F150M
pin_labels:
- {pin_num: '34', pin_signal: PTA0/UART0_CTS_b/UART0_COL_b/FTM0_CH5/XBARIN4/EWM_IN/JTAG_TCLK/SWD_CLK, label: 'J3[4]/U5[13]/SWCLK/SWDCLK_ISOLATED'}
- {pin_num: '36', pin_signal: PTA2/UART0_TX/FTM0_CH7/CMP1_OUT/FTM1_CH0/JTAG_TDO/TRACE_SWO, label: 'J3[6]/U5[12]/SWO/SWO_ISOLATED'}
- {pin_num: '37', pin_signal: PTA3/UART0_RTS_b/FTM0_CH0/XBARIN9/EWM_OUT/FlexPWM_A0/JTAG_TMS/SWD_DIO, label: 'J3[2]/U4[3]/U5[14]/SWDIO/SWDIO_ISOLATED'}
- {pin_num: '38', pin_signal: PTA4/LLWU_P3/FTM0_CH1/XBARIN10/FTM0_FLT3/FlexPWM_B0/NMI_b, label: NMI}
- {pin_num: '50', pin_signal: EXTAL0/PTA18/XBARIN7/FTM0_FLT2/FTM_CLKIN0/XBAROUT8/FTM3_CH2, label: 'Y2[1]/EXTAL0', identifier: EXTAL0}
- {pin_num: '51', pin_signal: XTAL0/PTA19/XBARIN8/FTM1_FLT0/FTM_CLKIN1/XBAROUT9/LPTMR0_ALT1, label: 'Y2[2]/XTAL0', identifier: XTAL0}
- {pin_num: '55', pin_signal: ADCA_CH6e/CMP2_IN2/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/FTM0_FLT3, label: USER_LED_2, identifier: LED_RED}
- {pin_num: '65', pin_signal: PTB19/CAN0_RX/FTM3_CH3, label: 'MB_J11[B20]/MB_U9[4]/MB_USER_LED/J4[B20]/USER_LED', identifier: LED_GREEN}
- {pin_num: '57', pin_signal: PTB9, label: NC}
- {pin_num: '63', pin_signal: PTB17/UART0_TX/FTM_CLKIN1/CAN0_RX/EWM_OUT_b, label: NC}
- {pin_num: '64', pin_signal: PTB18/CAN0_TX/FTM3_CH2, label: NC}
- {pin_num: '68', pin_signal: PTB22/FlexPWM_X2/CMP2_OUT, label: 'U1[69]/PTB23', identifier: BEMF_C_CAPTURE}
- {pin_num: '69', pin_signal: PTB23/SPI0_PCS5/FlexPWM_X3/CMP3_OUT, label: 'U1[68]/PTB22', identifier: BEMF_C_CMP_OUT}
- {pin_num: '14', pin_signal: ADCA_CH6a, label: NC}
- {pin_num: '20', pin_signal: ADCA_CH6c, label: NC}
- {pin_num: '52', pin_signal: RESET_b, label: 'J3[10]/U2[21]/U5[11]/SW1/''/RESET''/''/RESET_ISOLATED''', identifier: RESET}
- {pin_num: '81', pin_signal: ADCB_CH6d/CMP0_IN3/PTC9/FTM3_CH5, label: NC}
- {pin_num: '82', pin_signal: ADCB_CH7d/PTC10/FTM3_CH6, label: NC}
- {pin_num: '83', pin_signal: ADCB_CH6e/PTC11/LLWU_P11/FTM3_CH7, label: NC}
- {pin_num: '84', pin_signal: PTC12/FTM_CLKIN0/FTM3_FLT0, label: NC}
- {pin_num: '91', pin_signal: PTC17/CAN1_TX, label: NC}
- {pin_num: '92', pin_signal: PTC18, label: NC}
- {pin_num: '3', pin_signal: ADCB_CH6g/PTE2/LLWU_P1/UART1_CTS_b, label: NC}
- {pin_num: '4', pin_signal: ADCB_CH7g/PTE3/UART1_RTS_b, label: NC}
- {pin_num: '5', pin_signal: PTE4/LLWU_P2, label: NC}
- {pin_num: '6', pin_signal: PTE5/FTM3_CH0, label: NC}
- {pin_num: '7', pin_signal: PTE6/LLWU_P16/FTM3_CH1, label: NC}
- {pin_num: '33', pin_signal: PTE26, label: NC}
- {pin_num: '22', pin_signal: VDDA, label: 3.3VA}
- {pin_num: '23', pin_signal: VREFH, label: 3.3VA}
- {pin_num: '8', pin_signal: VDD8, label: 3.3V}
- {pin_num: '30', pin_signal: VDD30, label: 3.3V}
- {pin_num: '40', pin_signal: VDD40, label: 3.3V}
- {pin_num: '48', pin_signal: VDD48, label: 3.3V}
- {pin_num: '61', pin_signal: VDD61, label: 3.3V}
- {pin_num: '75', pin_signal: VDD75, label: 3.3V}
- {pin_num: '89', pin_signal: VDD89, label: 3.3V}
- {pin_num: '25', pin_signal: VSSA, label: GNDA}
- {pin_num: '9', pin_signal: VSS9, label: GND}
- {pin_num: '29', pin_signal: VSS29, label: GND}
- {pin_num: '41', pin_signal: VSS41, label: GND}
- {pin_num: '49', pin_signal: VSS49, label: GND}
- {pin_num: '60', pin_signal: VSS60, label: GND}
- {pin_num: '74', pin_signal: VSS74, label: GND}
- {pin_num: '88', pin_signal: VSS88, label: GND}
- {pin_num: '24', pin_signal: VREFL, label: GNDA}
- {pin_num: '73', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/FTM3_FLT0, label: 'U2[25]/U6[14]/RxD_sda/UART_RX_TGTMCU', identifier: UART_RX_TGTMCU}
- {pin_num: '76', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/CMP1_OUT, label: 'U2[24]/U6[13]/TxD_sda/UART_TX_TGTMCU', identifier: UART_TX_TGTMCU}
- {pin_num: '46', pin_signal: CMP3_IN2/PTA16/SPI0_SOUT/UART0_CTS_b/UART0_COL_b, label: TP19}
- {pin_num: '47', pin_signal: ADCA_CH7e/PTA17/SPI0_SIN/UART0_RTS_b, label: TP21}
- {pin_num: '70', pin_signal: ADCB_CH6b/PTC0/SPI0_PCS4/PDB0_EXTRG/FTM0_FLT1/SPI0_PCS0, label: TP18}
- {pin_num: '45', pin_signal: CMP3_IN1/PTA15/SPI0_SCK/UART0_RX, label: TP20}
- {pin_num: '86', pin_signal: PTC14/I2C0_SCL, label: TP23}
- {pin_num: '87', pin_signal: PTC15/I2C0_SDA, label: TP22}
- {pin_num: '21', pin_signal: ADCA_CH7c, label: TP24}
- {pin_num: '35', pin_signal: PTA1/UART0_RX/FTM0_CH6/CMP0_OUT/FTM1_CH1/JTAG_TDI, label: 'U1[66]/cmp0_out', identifier: BEMF_A_CMP_OUT}
- {pin_num: '66', pin_signal: PTB20/FlexPWM_X0/CMP0_OUT, label: 'U1[35]/cmp0_out', identifier: BEMF_A_CAPTURE}
- {pin_num: '1', pin_signal: ADCB_CH6f/PTE0/UART1_TX/XBAROUT10/XBARIN11, label: 'MB_J9[5]/MB_J11[B16]/MB_TP19/MB_ENC_Index/J4[B16]/TM2', identifier: ENC_INDEX}
- {pin_num: '2', pin_signal: ADCB_CH7f/PTE1/LLWU_P0/UART1_RX/XBAROUT11/XBARIN7, label: 'MB_J11[A25]/MB_U12[11]/MB_TP28/MB_FAULT/MB_FAULT_1/MB_PFC_overcurrent/J4[A25]/FAULT_1',
  identifier: FAULT_1}
- {pin_num: '10', pin_signal: ADCA_CH0/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, label: 'MB_J11[A7]/MB_TP18/MB_Vin/J4[A7]/V_in', identifier: V_IN}
- {pin_num: '11', pin_signal: ADCA_CH1/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, label: 'MB_J11[B4]/MB_TP31/MB_V_sense_DCB/MB_DCB_Pos/J4[B4]/U_dcb',
  identifier: U_DCB}
- {pin_num: '12', pin_signal: ADCB_CH0/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA, label: 'MB_J11[B5]/MB_TP33/''MB_V_sense_DCB/2''/J4[B5]/''U_dcb/2''', identifier: U_DCB_HALF}
- {pin_num: '13', pin_signal: ADCB_CH1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/CMP3_OUT, label: 'MB_J11[B9]/MB_U12[2]/MB_TP38/MB_IPM_temp/J4[B9]/Temp_IPM', identifier: TEMP_IPM}
- {pin_num: '16', pin_signal: ADCA_CH6b/PTE20/FTM1_CH0/UART0_TX, label: 'MB_J1[1]/MB_J2[3]/MB_J11[A31]/MB_TxD_1/MB_TxD_EXT/J4[A31]/TxD1', identifier: TXD_1}
- {pin_num: '17', pin_signal: ADCA_CH7b/PTE21/FTM1_CH1/UART0_RX, label: 'MB_J2[4]/MB_J3[4]/MB_J11[A32]/MB_RxD_1/MB_RxD_EXT/J4[A32]/RxD1', identifier: RXD_1}
- {pin_num: '15', pin_signal: ADCA_CH7a, label: 'MB_J11[A8]/MB_U2B[7]/MB_TP14/MB_Ipfc1/J4[A8]/I_pfc1', identifier: I_PFC_1}
- {pin_num: '18', pin_signal: ADCA_CH2, label: 'MB_J11[A3]/MB_U11A[1]/MB_TP45/MB_I_sense_A/J4[A3]/I_phA', identifier: I_PH_A}
- {pin_num: '19', pin_signal: ADCA_CH3, label: 'MB_J11[A5]/MB_U8A[1]/MB_TP37/MB_I_sense_C/J4[A5]/I_phC', identifier: I_PH_C}
- {pin_num: '26', pin_signal: ADCA_CH4/CMP1_IN5/CMP0_IN5/PTE29/FTM0_CH2/FTM_CLKIN0, label: 'MB_J11[B3]/MB_U8B[7]/MB_TP34/MB_I_sense_DCB/J4[B3]/I_dcb', identifier: I_DCB}
- {pin_num: '27', pin_signal: DAC0_OUT/CMP1_IN3/ADCA_CH5/PTE30/FTM0_CH3/FTM_CLKIN1, label: 'MB_J11[A6]/MB_TP16/MB_TACHO/J4[A6]/TACHO', identifier: TACHO}
- {pin_num: '28', pin_signal: ADCA_CH6d/CMP0_IN4/CMP2_IN3, label: 'MB_J11[B6]/MB_TP44/MB_BEMF_sense_A/MB_Phase_A/J4[B6]/BEMF_A', identifier: BEMF_A;BEMF_A_CMP_IN}
- {pin_num: '31', pin_signal: ADCB_CH4/PTE24/CAN1_TX/FTM0_CH0/XBARIN2/I2C0_SCL/EWM_OUT_b/XBAROUT4, label: 'MB_J11[B7]/MB_TP43/MB_BEMF_sense_B/MB_Phase_B/J4[B7]/BEMF_B',
  identifier: BEMF_B}
- {pin_num: '32', pin_signal: ADCB_CH5/PTE25/LLWU_P21/CAN1_RX/FTM0_CH1/XBARIN3/I2C0_SDA/EWM_IN/XBAROUT5, label: 'MB_J11[B8]/MB_TP41/MB_BEMF_sense_C/MB_Phase_C/J4[B8]/BEMF_C',
  identifier: BEMF_C}
- {pin_num: '39', pin_signal: PTA5/FTM0_CH2/CMP2_OUT/JTAG_TRST_b, label: 'U1[67]/cmp2_out', identifier: BEMF_B_CMP_OUT}
- {pin_num: '42', pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA, label: 'MB_J11[B7]/MB_TP43/MB_BEMF_sense_B/MB_Phase_B/J4[B7]/BEMF_B', identifier: BEMF_B_CMP_IN}
- {pin_num: '43', pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/FTM1_QD_PHB, label: 'MB_J11[A26]/MB_U9[2]/MB_TP35/MB_FAULT_2/MB_Over-voltage_FAULT/J4[A26]/FAULT_2',
  identifier: FAULT_2}
- {pin_num: '44', pin_signal: CMP3_IN0/PTA14/SPI0_PCS0/UART0_TX, label: 'MB_J11[B8]/MB_TP41/MB_BEMF_sense_C/MB_Phase_C/J4[B8]/BEMF_C', identifier: BEMF_C_CMP_IN}
- {pin_num: '53', pin_signal: ADCB_CH2/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX, label: 'MB_J11[A4]/MB_U11B[7]/MB_TP40/MB_I_sense_B/J4[A4]/I_phB', identifier: I_PH_B}
- {pin_num: '54', pin_signal: ADCB_CH3/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX, label: 'MB_J11[A5]/MB_U8A[1]/MB_TP37/MB_I_sense_C/J4[A5]/I_phC',
  identifier: I_PH_C_2}
- {pin_num: '56', pin_signal: ADCB_CH7e/CMP3_IN5/PTB3/I2C0_SDA/UART0_CTS_b/UART0_COL_b/FTM0_FLT0, label: 'MB_J11[A9]/MB_U2A[1]/MB_TP5/MB_Ipfc2/J4[A9]/I_pfc2', identifier: I_PFC_2}
- {pin_num: '58', pin_signal: ADCB_CH6a/PTB10/FTM0_FLT1, label: 'MB_J11[A30]/MB_TP22/J4[A30]/MB_TP_22'}
- {pin_num: '59', pin_signal: ADCB_CH7a/PTB11/FTM0_FLT2, label: 'MB_J11[A29]/MB_TP24/J4[A29]/MB_TP_24'}
- {pin_num: '62', pin_signal: PTB16/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN/XBARIN5, label: 'MB_J9[3]/MB_J11[B14]/MB_TP13/MB_ENC_PhaseA/J4[B14]/TM0', identifier: ENC_PHASE_A}
- {pin_num: '67', pin_signal: PTB21/FlexPWM_X1/CMP1_OUT, label: 'U1[39]/cmp2_out', identifier: BEMF_B_CAPTURE}
- {pin_num: '71', pin_signal: ADCB_CH7b/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FlexPWM_A3/XBARIN11, label: 'MB_J11[A22]/MB_U14[4]/MB_TP15/MB_PWM_PFC2/J4[A22]/PWM8',
  identifier: PWM_PFC2}
- {pin_num: '72', pin_signal: ADCB_CH6c/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FlexPWM_B3/XBARIN6, label: 'MB_J11[A23]/MB_U14[2]/MB_TP12/MB_PWM_PFC1/J4[A23]/PWM9',
  identifier: PWM_PFC1}
- {pin_num: '77', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/XBARIN2/CMP0_OUT/FTM0_CH2, label: 'MB_J9[4]/MB_J11[B15]/MB_TP17/MB_ENC_PhaseB/J4[B15]/TM1', identifier: ENC_PHASE_B}
- {pin_num: '78', pin_signal: CMP2_IN4/CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/XBARIN3/UART0_RX/XBAROUT6/I2C0_SCL, label: 'MB_J11[B21]/MB_PFC_zc_2/J4[B21]/MB_TP_27',
  identifier: PFC_ZC_2}
- {pin_num: '79', pin_signal: CMP3_IN4/CMP0_IN1/PTC7/SPI0_SIN/XBARIN4/UART0_TX/XBAROUT7/I2C0_SDA, label: 'MB_J11[B22]/MB_PFC_zc_1/J4[B22]/MB_TP_26', identifier: PFC_ZC_1}
- {pin_num: '80', pin_signal: ADCB_CH7c/CMP0_IN2/PTC8/FTM3_CH4, label: 'MB_J11[B17]/J4[B17]/MB_TP_29'}
- {pin_num: '85', pin_signal: PTC13/FTM_CLKIN1, label: 'MB_J11[B28]/MB_Q3[1]/MB_Relay/J4[B28]/Relay', identifier: RELAY}
- {pin_num: '90', pin_signal: PTC16/CAN1_RX, label: 'MB_J11[B25]/MB_U9[2]/MB_TP_35/MB_MCU_BRAKE/J4[B25]/MCU_BRAKE', identifier: MCU_BRAKE}
- {pin_num: '93', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/FTM3_CH0/FTM0_CH0/FlexPWM_A0, label: 'MB_J11[A14]/MB_U12[18]/MB_PWM_AT/J4[A14]/PWM0', identifier: PWM_AT}
- {pin_num: '94', pin_signal: ADCA_CH7f/PTD1/SPI0_SCK/FTM3_CH1/FTM0_CH1/FlexPWM_B0, label: 'MB_J11[A15]/MB_U12[12]/MB_PWM_AB/J4[A15]/PWM1', identifier: PWM_AB}
- {pin_num: '95', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/FTM3_CH2/FTM0_CH2/FlexPWM_A1/I2C0_SCL, label: 'MB_J11[A16]/MB_U12[19]/MB_PWM_BT/J4[A16]/PWM2', identifier: PWM_BT}
- {pin_num: '96', pin_signal: PTD3/SPI0_SIN/FTM3_CH3/FTM0_CH3/FlexPWM_B1/I2C0_SDA, label: 'MB_J11[A17]/MB_U12[13]/MB_PWM_BB/J4[A17]/PWM3', identifier: PWM_BB}
- {pin_num: '97', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FlexPWM_A2/EWM_IN/SPI0_PCS0, label: 'MB_J11[A18]/MB_U12[20]/MB_PWM_CT/J4[A18]/PWM4', identifier: PWM_CT}
- {pin_num: '98', pin_signal: ADCA_CH6g/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FlexPWM_B2/EWM_OUT_b/SPI0_SCK, label: 'MB_J11[A19]/MB_U12[14]/MB_PWM_CB/J4[A19]/PWM5',
  identifier: PWM_CB}
- {pin_num: '100', pin_signal: PTD7/UART0_TX/FTM0_CH7/FTM1_CH1/FTM0_FLT1/SPI0_SIN, label: 'MB_J1[3]/MB_J11[B26]/MB_U1[13]/MB_U3[25]/MB_TP3/MB_TP7/MB_TxD/J4[B26]/TxD',
  identifier: TXD}
- {pin_num: '99', pin_signal: ADCA_CH7g/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FTM1_CH0/FTM0_FLT0/SPI0_SOUT, label: 'MB_J3[2]/MB_J11[B27]/MB_U1[12]/MB_U3[26]/MB_TP2/MB_TP10/MB_RxD/J4[B27]/RxD',
  identifier: RXD}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_xbara.h"
#include "pin_mux.h"

