Masmiseim36/nxpSDK/boards/hvpkv46f150m/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : MB_InitANA_SENSPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void MB_InitANA_SENSPins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTB0 (pin 53) is configured as ADCB_CH2 */
    PORT_SetPinMux(MB_I_PH_B_PORT, MB_I_PH_B_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB1 (pin 54) is configured as ADCB_CH3 */
    PORT_SetPinMux(MB_I_PH_C_2_PORT, MB_I_PH_C_2_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB3 (pin 56) is configured as ADCB_CH7e */
    PORT_SetPinMux(MB_I_PFC_2_PORT, MB_I_PFC_2_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE16 (pin 10) is configured as ADCA_CH0 */
    PORT_SetPinMux(MB_V_IN_PORT, MB_V_IN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE17 (pin 11) is configured as ADCA_CH1 */
    PORT_SetPinMux(MB_U_DCB_PORT, MB_U_DCB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE18 (pin 12) is configured as ADCB_CH0 */
    PORT_SetPinMux(MB_U_DCB_HALF_PORT, MB_U_DCB_HALF_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE19 (pin 13) is configured as ADCB_CH1 */
    PORT_SetPinMux(MB_TEMP_IPM_PORT, MB_TEMP_IPM_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE29 (pin 26) is configured as ADCA_CH4 */
    PORT_SetPinMux(MB_I_DCB_PORT, MB_I_DCB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE30 (pin 27) is configured as ADCA_CH5 */
    PORT_SetPinMux(MB_TACHO_PORT, MB_TACHO_PIN, kPORT_PinDisabledOrAnalog);

    SIM->ADCOPT = ((SIM->ADCOPT &
                    /* Mask bits to zero which are setting */
                    (~(SIM_ADCOPT_ADCACH7SEL_MASK | SIM_ADCOPT_ADCBCH7SEL_MASK)))

                   /* ADCA MUX1 selection for ADCA channel 7: ADCA MUX1's channel a. */
                   | SIM_ADCOPT_ADCACH7SEL(ADCOPT_ADCACH7SEL_CH_A)

                   /* ADCB MUX1 selection for ADCB channel 7: ADCB MUX1's channel e. */
                   | SIM_ADCOPT_ADCBCH7SEL(ADCOPT_ADCBCH7SEL_CH_E));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
MB_InitBEMFPins:
- options: {callFromInitBoot: 'false', prefix: MB_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '28', peripheral: ADC, signal: 'ADCA, 6', pin_signal: ADCA_CH6d/CMP0_IN4/CMP2_IN3, identifier: BEMF_A}
  - {pin_num: '28', peripheral: CMP0, signal: 'IN, 4', pin_signal: ADCA_CH6d/CMP0_IN4/CMP2_IN3, identifier: BEMF_A_CMP_IN}
  - {pin_num: '35', peripheral: CMP0, signal: OUT, pin_signal: PTA1/UART0_RX/FTM0_CH6/CMP0_OUT/FTM1_CH1/JTAG_TDI}
  - {pin_num: '66', peripheral: PWMA, signal: 'X, 0', pin_signal: PTB20/FlexPWM_X0/CMP0_OUT, direction: INPUT}
  - {pin_num: '31', peripheral: ADC, signal: 'ADCB, 4', pin_signal: ADCB_CH4/PTE24/CAN1_TX/FTM0_CH0/XBARIN2/I2C0_SCL/EWM_OUT_b/XBAROUT4}
  - {pin_num: '42', peripheral: CMP2, signal: 'IN, 0', pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA}
  - {pin_num: '39', peripheral: CMP2, signal: OUT, pin_signal: PTA5/FTM0_CH2/CMP2_OUT/JTAG_TRST_b}
  - {pin_num: '67', peripheral: PWMA, signal: 'X, 1', pin_signal: PTB21/FlexPWM_X1/CMP1_OUT, direction: INPUT}
  - {pin_num: '32', peripheral: ADC, signal: 'ADCB, 5', pin_signal: ADCB_CH5/PTE25/LLWU_P21/CAN1_RX/FTM0_CH1/XBARIN3/I2C0_SDA/EWM_IN/XBAROUT5}
  - {pin_num: '44', peripheral: CMP3, signal: 'IN, 0', pin_signal: CMP3_IN0/PTA14/SPI0_PCS0/UART0_TX}
  - {pin_num: '69', peripheral: CMP3, signal: OUT, pin_signal: PTB23/SPI0_PCS5/FlexPWM_X3/CMP3_OUT}
  - {pin_num: '68', peripheral: PWMA, signal: 'X, 2', pin_signal: PTB22/FlexPWM_X2/CMP2_OUT, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : MB_InitBEMFPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void MB_InitBEMFPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA1 (pin 35) is configured as CMP0_OUT */
    PORT_SetPinMux(MB_BEMF_A_CMP_OUT_PORT, MB_BEMF_A_CMP_OUT_PIN, kPORT_MuxAlt4);

    /* PORTA12 (pin 42) is configured as CMP2_IN0 */
    PORT_SetPinMux(MB_BEMF_B_CMP_IN_PORT, MB_BEMF_B_CMP_IN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA14 (pin 44) is configured as CMP3_IN0 */
    PORT_SetPinMux(MB_BEMF_C_CMP_IN_PORT, MB_BEMF_C_CMP_IN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA5 (pin 39) is configured as CMP2_OUT */
    PORT_SetPinMux(MB_BEMF_B_CMP_OUT_PORT, MB_BEMF_B_CMP_OUT_PIN, kPORT_MuxAlt5);

    /* PORTB20 (pin 66) is configured as FlexPWM_X0 */
    PORT_SetPinMux(MB_BEMF_A_CAPTURE_PORT, MB_BEMF_A_CAPTURE_PIN, kPORT_MuxAlt5);

    /* PORTB21 (pin 67) is configured as FlexPWM_X1 */
    PORT_SetPinMux(MB_BEMF_B_CAPTURE_PORT, MB_BEMF_B_CAPTURE_PIN, kPORT_MuxAlt5);

    /* PORTB22 (pin 68) is configured as FlexPWM_X2 */
    PORT_SetPinMux(MB_BEMF_C_CAPTURE_PORT, MB_BEMF_C_CAPTURE_PIN, kPORT_MuxAlt5);

    /* PORTB23 (pin 69) is configured as CMP3_OUT */
    PORT_SetPinMux(MB_BEMF_C_CMP_OUT_PORT, MB_BEMF_C_CMP_OUT_PIN, kPORT_MuxAlt6);

    /* PORTE24 (pin 31) is configured as ADCB_CH4 */
    PORT_SetPinMux(MB_BEMF_B_PORT, MB_BEMF_B_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE25 (pin 32) is configured as ADCB_CH5 */
    PORT_SetPinMux(MB_BEMF_C_PORT, MB_BEMF_C_PIN, kPORT_PinDisabledOrAnalog);

